package com.example.coup.domain.enums;

public enum ActionType {
    INCOME,         // รับ 1 เหรียญ (บล็อกไม่ได้, แย้งไม่ได้)
    FOREIGN_AID,    // รับ 2 เหรียญ (บล็อกได้ด้วย ราชา)
    COUP,           // รัฐประหาร จ่าย 7 ฆ่า 1 (บล็อกไม่ได้, แย้งไม่ได้)
    
    TAX,            // (ราชา) รับ 3 เหรียญ
    ASSASSINATE,    // (นักฆ่า) จ่าย 3 ฆ่า 1 (บล็อกได้ด้วย สตรีศักดิ์สิทธิ์)
    STEAL,          // (นักผจญภัย) ปล้น 2 เหรียญ (บล็อกได้ด้วย นักผจญภัย หรือ พ่อค้า)
    EXCHANGE        // (พ่อค้า) จั่ว 2 คืน 2
}
